from config import rusogl, uasogl, egsogl

class Ru():

	#otherkeys
	kbclose = "❌ Закрыть"
	kbhelp1 = "👨‍💻 Поддержка"
	kbback = "🔙Назад🔙"
	kbotmena = "🔙Отмена🔙"
	#
	block = "⚠️ Данное действие заблокировано, обратитесь в тех. поддержку"
	error = "⚠️ Такой команды не существует!"
	#sogl
	newref = "🧑‍💻 У вас новый реферал"
	newref2 = "🌟 Всего рефералов"
	soglashenie = "⚠️ Перед началом работы ознакомьтесь с"
	soglashenielink = f"<a href='{rusogl}'>пользовательским соглашением</a>"

	kbsogl = "✅ Принимаю"
	#

	#start
	start = "👋 Добро пожаловать в мульти криптовалютную криптобиржу BitMart"
	kbstart = "📁 Личный кабинет"
	#

	#menu
	menu1 = "🤴 Личный кабинет"
	menu2 = "💰 Ваш баланс:"
	menu3 = "📤 На выводе:"
	menu4 = "🪪 Статус верификации:"
	menu5 = "🤝 Выполнение сделки:"
	menu6 = "📊 Торговый рейтинг:"
	menu7 = "⚡️ Количество рефералов:"
	menu8 = "📅 Дата регистрации:"
	menu9 = "🟢 Пользователей онлайн:"
	
	#
	kbmenu1 = "📥 Пополнить"
	kbmenu2 = "📤 Вывести"
	kbmenusite = "📰 Официальный сайт"
	kbmenu3 = "⚙️ Настройки"

	kbmenu4 = "💱 Торговая площадка"
	kbmenu5 = "ℹ️ Информация"
	kbmenu6 = "🛠 Поддержка"
	#

	#help
	helptext = "<b>Правила обращения в Техническую Поддержку:\n\n\
🔹1. Представьтесь, изложите проблему своими словами - мы постараемся Вам помочь.\n\n\
🔹2. Напишите свой ID - нам это нужно, чтобы увидеть ваш профиль, и узнать актуальность вашей проблемы.\n\n\
🔹3. Будьте вежливы, наши консультанты не роботы, мы постараемся помочь Вам, и сделать все возможное, чтобы сберечь ваше время и обеспечить максимальную оперативность в работе.\n\n\
Напишите нам, ответ Поддержки, не заставит вас долго ждать!</b>"

	#settigs
	settings = "<b>👨‍💻 Выберите действие</b>"
	#
	kbsettings1 = "💱 Сменить валюту"
	kbsettings2 = "💬 Сменить язык"
	kbsettings3 = "📑 Верификация"
	#

	#setvalut
	setvalut = "<b>💱 Выберите свою валюту</b>"
	setvalut2 = "💱 Ваша новая валюта"
	#

	#info
	infotext = "<b>🔹 О Сервисе\n\n\
BitMart — это безопасная и надежная платформа для обмена криптовалют, основанная в Великобритании в 2014 году. Мы поддерживаем более 190 пар и 50 криптовалют.\n\n\
❓Частые вопросы и ответы на них\n\n\
1. Как происходит инвестирование?\n\
• Инвестирование происходит в краткие сроки на фоне падения или роста активов.\n\n\
2. Как работает реферальная система?\n\
• После перехода друга по вашей реферальной ссылке вам начисляются бонусы за его активность. Так же это влияет на ваш рейтинг.\n\n\
3. Что такое рейтинг?\n\
• Рейтинг это показатель вашей активности.\n\n\
4. Зачем нужна верификация?\n\
• Верификация аккаунта нужна для проведения денежных операций в крупных размерах.А так же вывод средств в приоритете для верефицированных аккаунтов.\n\n\
• Если возникают вопросы обращайтесь в Тех. Поддержку.</b>"
	#
	kbinfo2 = "📣 Сообщить об ошибке"
	#

	#setlang
	setlang1 = "<b>💬 Выбери свой язык</b>"
	setlang2 = "💬 Твой язык теперь русский"
	#

	#verif
	veriftext = "<b>❓ Верификация аккаунта нужна для проведения денежных операций в крупных размерах.\n\
❗️ Верификацию можно пройти только с помощью тех.поддержки.\n\
❗️ Для верификаци Тех.поддержка может запросить ваши паспортные данные для удостоверения личности и для подтверждения вашего совершеннолетия.</b>"
	kbverif = "✔️ Пройти верификацию"
	#

	#popoln
	popoln = "<b>📥 Выберите метод пополнения:</b>"
	popoln2 = "<b>Пополнение в</b>"
	popoln3 = "<b>Чтобы пополнить свой счёт из внешнего крипто - кошелька, используйте многоразовый адрес ниже.</b>"
	popoln4 = "<b>💱 Адрес</b>"
	popoln5 = "<b>Средства автоматически будут зачислены на ваш счёт в течении некоторого времени. При возникновении вопросов обращайтесь в службу поддержки.</b>"
	popoln6 = "<b>⚠️ Уважаемый пользователь, обратите внимание, что все платежи менее</b>"
	popoln7 = "<b>не будут зачислены на сервис, компенсация за данные операции также не предусмотрена.</b>"

	popolncard1 = "Минимальная сумма пополнения:"
	popolncard2 = "Введите сумму:"

	popolncard3 = "<b>📥 Пополнение баланса</b>"
	popolncard4 = "<b>💳 Реквизиты:</b>"
	popolncard5 = "<b>💬 Комментарий</b>"
	popolncard6 = "<b>⚠️ Для пополнения баланса переведите указанную сумму:</b>"
	popolncard7 = "<b>, на реквизиты указанные выше!\n\n\
⚠️ Средства автоматически поступят на ваш счёт в течении 10-ти минут.\n\n\
💬 Нажмите на реквизиты или комментарий, чтобы скопировать!\n\n\
🔰 Если вы не можете указать комментарий, после оплаты пришлите чек/скриншот или же квитанцию в техническую поддержку.\n\n\
🛠 Тех.Поддержка</b>"

	popolncard8 = "<b>⚠️ Минимальная сумма пополнения:</b>"
	popolncard9 = "<b>⚠️ Некоррректный ввод</b>"
	sucpopoln = "<b>✅ Ваш счет пополнен на</b>"
	popolnpaysend1 = "<b>Оплата через Paysend Global Transfers</b>\n\nДля пополнения счета через Paysend, перейдите на https://paysend.com/ и заполните форму.\n\n\
Страна отправитель: Ваша страна\n\
Страна получатель: Украина\n\
Карта получателя:"
	popolnpaysend2 = "Имя получателя: <code>BitMart</code>\n\n<i>После внесения средств отправьте скриншот перевода в службу технической поддержки, и средства будут зачислены на ваш счет.</i>"

	kbpopoln1 = "💳 Банковская карта"
	kbpopoln2 = "🔶 Bitcoin"
	kbpopoln3 = "🔷 Ethereum"
	kbpopoln4 = "💲 USDT"
	#

	#vivod
	kbotmenavivod = "❌ Отменить вывод"
	alertvivod = "⚠️ Заявка на вывод отменена"
	vivod1 = "<b>⚠️ Обратите внимание, в целях безопасности вывод средств производится на те реквизиты, с которых было произведено последнее пополнение.\n\nВыберите метод снятия:</b>"
	vivodcrypto = "<b>Вывод средств в криптовалюте\n\n⚠️ Уважаемый пользователь, по техническим причинам вывод средств в криптовалюте возможен только через службу технической поддержки.</b>"
	vivodcard1 = "Минимальная сумма вывода:"
	vivodcard2 = "Доступный баланс:"
	vivodcard31 = "Введите сумму:"

	vivodcard3 = "<b>✅ Заявка на вывод была успешно оформлена!\n\nПожалуйста, подождите, пока она будет обработана.</b>"
	vivodcard4 = "<b>⚠️ На балансе недостаточно средств!</b>"
	vivodcard5 = "<b>⚠️ Минимальная сумма вывода!</b>"
	sucvivod = "<b>✅ Вывод средств был одобрен!</b>"
	#

	#trade
	faq = "<b>Как это работает?\n\n\
• Рекомендуем изучить курсы перед инвестициями, или иметь опытного наставника.\n\
• Инвестиции происходят в краткосрочном режиме.\n\
• Выберите область для инвестирования, затем сумму и время позиции, дождитесь результатов инвестирования.\n\
• Позиции открываються с 100Х кредитным плечем.\n\
• Наша компания не несёт ответственности за риски связанные с ростом/падением котировок.</b>"

	trademsg = "<b>💠 Выберите область для инвестирования капитала</b>"
	cryptomsg = "<b>💠 Выберите токен для инвестирования капитала</b>"
	companiesmsg = "<b>💠 Выберите акции для инвестирования капитала</b>"
	rk = "<b>💠 Рыночная капитализация:</b>"
	kursl = "<b>💲 Курс:</b>"
	dvl = "<b>↕️ Движение рынка:</b>"
	pil = "<b>📊 Последнее изменение:</b>"
	futures1 = "<b>💠 Введите сумму позиции</b>"
	futures2 = "<b>🏦 Ваш баланс:</b>"
	futures3 = "<b>Минимальная позиция:</b>"
	position1 = "<b>📊 Позиция открыта:</b>"
	position2 = "<b>📊 Позиция закрыта:</b>"
	ubl = "<b>📉 Убыток:</b>"
	prl = "<b>📈 Прибыль:</b>"
	pat = "<b>➖ Пат:</b>"
	kbtrade1 = "🪙 Криптовалюты"
	kbtrade2 = "🛡 Акции компаний"
	kbfut1 = "📀 Обновить 📀"
	kbfut2 = "📈 Long, покупка, 100X"
	kbfut3 = "📉 Short, продажа, 100X"
	kbpos1 = "10сек"
	kbpos2 = "30сек"
	kbpos3 = "60сек"
	positionl1 = "<b>💠 Выберите длительность удерживания позиции</b>"
	positionl2 = "<b>⚠️ Минимальный размер позиции</b>"
	positionl3 = "<b>⚠️ Недостаточно денег на балансе!\nВаш баланс:</b>"
	#

class Ua():

	#otherkeys
	kbclose = "❌ Закрити"
	kbhelp1 = "👨‍💻 Підтримка"
	kbback = "🔙Назад🔙"
	kbotmena = "🔙Скасувати🔙"
	#
	block = "⚠️ Ця дія заблокована, зверніться до технічної підтримки"
	error = "⚠️ Такої команди немає!"
	#sogl
	newref = "🧑‍💻 У вас новий реферал"
	newref2 = "🌟 Усього рефералів"
	soglashenie = "⚠️ Перед початком роботи ознайомся з"
	soglashenielink = f"<a href='{rusogl}'>користувальницькою угодою</a>"

	kbsogl = "✅ Приймаю"
	#

	#start
	start = "👋 Ласкаво просимо до мульти криптовалютної криптобіржі BitMart"
	kbstart = "📁 Особистий кабінет"
	#

	#menu
	menu1 = "🤴 Особистий кабінет"
	menu2 = "💰 Ваш баланс:"
	menu3 = "📤 На виводi:"
	menu4 = "🪪 Статус верифікації:"
	menu5 = "🤝 Виконанi угоди:"
	menu6 = "📊 Торговий рейтинг:"
	menu7 = "⚡️ Кількість рефералів:"
	menu8 = "📅 Дата реєстрації:"
	menu9 = "🟢 Користувачів онлайн:"
	
	#
	kbmenu1 = "📥 Поповнити"
	kbmenu2 = "📤 Вивести"
	kbmenusite = "📰 Офіційний сайт"
	kbmenu3 = "⚙️ Налаштування"

	kbmenu4 = "💱 Торговий майданчик"
	kbmenu5 = "ℹ️ Інформація"
	kbmenu6 = "🛠 Підтримка"
	#

	#help
	helptext = "<b>Правила звернення до Технічної підтримки:\n\n\
🔹1. Представтеся, розкажiть про проблему своїми словами - ми постараємося вам допомогти.\n\n\
🔹2. Напишіть свій ID - нам це потрібно, щоб побачити ваш профіль, і дізнатися про актуальність вашої проблеми.\n\n\
🔹3. Будьте ввічливі, наші консультанти не роботи, ми намагатимемося допомогти вам, і зробити все можливе, щоб зберегти ваш час і забезпечити максимальну оперативність у роботі.\n\n\
Напишіть нам, відповідь Підтримки, не змусить вас довго чекати!</b>"

	#settigs
	settings = "<b>👨‍💻 Виберіть дію</b>"
	#
	kbsettings1 = "💱 Змінити валюту"
	kbsettings2 = "💬 Змінити мову"
	kbsettings3 = "📑 Верифікація"
	#

	#setvalut
	setvalut = "<b>💱 Виберіть свою валюту</b>"
	setvalut2 = "<b>💱 Ваша нова валюта"
	#

	#info
	infotext = "<b>🔹 Про Сервіс\n\n\
BitMart – це безпечна та надійна платформа для обміну криптовалют, заснована у Великобританії у 2014 році. Ми підтримуємо понад 190 пар та 50 криптовалют.\n\n\
❓Часті запитання та відповіді на них\n\n\
1. Як відбувається інвестування?\n\
• Інвестування відбувається у стислі терміни на тлі падіння чи зростання активів.\n\
2. Як працює реферальна система?\n\
• Після переходу друга за вашим реферальним посиланням вам нараховуються бонуси за його активність.\n\
Також це впливає на ваш рейтинг.\n\
3. Що таке рейтинг?\n\
• Рейтинг – це показник вашої активності.\n\
4. Навіщо потрібна верифікація?\n\
• Верифікація акаунту необхідна щодо фінансових операцій великих розмірів.\n\
А також виведення коштів у пріоритеті для верифікованих акаунтів.\n\n\
• Якщо виникають питання звертайтесь до Тех. Підтримки.</b>"

	#
	kbinfo2 = "📣 Повідомити про помилку"
	#

	#setlang
	setlang1 = "<b>💬 Вибери свою мову</b>"
	setlang2 = "💬 Твоя мова тепер українська"
	#

	#verif
	veriftext = "<b>❓Верифікація акаунту необхідна щодо фінансових операцій великих розмірів.\n\
❗️Верифікацію можна пройти тільки за допомогою технічної підтримки.\n\
❗️Для верифікації Тех.підтримка може запросити ваші паспортні дані для посвідчення особи та для підтвердження вашого повноліття.</b>"

	kbverif = "✔️ Пройти верифікацію"
	#

	#popoln
	popoln = "<b>📥 Виберіть метод поповнення:</b>"
	popoln2 = "<b>Поповнення в</b>"
	popoln3 = "<b>Щоб поповнити свій рахунок із зовнішнього крипто-гаманця, використовуйте багаторазову адресу нижче.</b>"
	popoln4 = "<b>💱 Адреса</b>"
	popoln5 = "<b>Кошти автоматично будуть зараховані на ваш рахунок протягом певного часу. У разі виникнення запитань звертайтеся до служби підтримки.</b>"
	popoln6 = "<b>⚠️ Шановний користувач, зверніть увагу, що всі платежі менші</b>"
	popoln7 = "<b>не будуть зараховані на сервіс, компенсація за ці операції також не передбачена.</b>"

	popolncard1 = "Мінімальна сума поповнення:"
	popolncard2 = "Введіть суму:"

	popolncard3 = "<b>📥 Поповнення рахунку</b>"
	popolncard4 = "<b>💳 Реквізити:</b>"
	popolncard5 = "<b>💬 Коментар</b>"
	popolncard6 = "<b>⚠️ Для поповнення балансу перерахуйте вказану суму:</b>"
	popolncard7 = "<b>, на реквізити вказані вище!\n\n\
⚠️ Кошти автоматично надійдуть на ваш рахунок протягом 10 хвилин.\n\n\
💬 Натисніть на реквізити або коментар, щоб скопіювати!\n\n\
🔰 Якщо ви не можете вказати коментар, після оплати надішліть чек/скриншот або квитанцію на технічну підтримку.\n\n\
🛠 Тех.Підтримка</b>"

	popolncard8 = "<b>⚠️ Мінімальна сума поповнення:</b>"
	popolncard9 = "<b>⚠️ Некоректне введення</b>"
	sucpopoln = "<b>✅ Ваш рахунок поповнено на</b>"
	popolnpaysend1 = "<b>Оплата через Paysend Global Transfers</b>\n\nЩоб поповнити рахунок через Paysend, перейдіть на https://paysend.com/ і заповніть форму.\n\n\
Країна відправник: Ваша країна\n\
Країна одержувач: Україна\n\
Карта отримувача:"
	popolnpaysend2 = "Ім'я одержувача: <code>BitMart</code>\n\n<i>Після внесення коштів надішліть скріншот переказу до служби технічної підтримки, і кошти будуть зараховані на ваш рахунок.</i>"

	kbpopoln1 = "💳 Банківська картка"
	kbpopoln2 = "🔶 Bitcoin"
	kbpopoln3 = "🔷 Ethereum"
	kbpopoln4 = "💲 USDT"
	#

	#vivod
	kbotmenavivod = "❌ Скасувати виведення"
	alertvivod = "⚠️ Заявку на виведення скасовано"
	vivod1 = "<b>⚠️ Зверніть увагу, з метою безпеки виведення коштів здійснюється на ті реквізити, з яких було зроблено останнє поповнення.\n\nВиберіть метод зняття:</b>"
	vivodcrypto = "<b>Виведення коштів у криптовалюті\n\n⚠️ Шановний користувач, з технічних причин виведення коштів у криптовалюті можливе лише через службу технічної підтримки.</b>"
	vivodcard1 = "Мінімальна сума виведення:"
	vivodcard2 = "Доступний баланс:"
	vivodcard31 = "Введіть суму:"

	vivodcard3 = "<b>✅ Заявка на виведення була успішно оформлена!\n\nЗачекайте, поки вона буде оброблена.</b>"
	vivodcard4 = "<b>⚠️ На балансі недостатньо коштів!</b>"
	vivodcard5 = "<b>⚠️ Мінімальна сума виведення!</b>"
	sucvivod = "<b>✅ Виведення коштів було схвалено!</b>"
	#

	#trade
	faq = "<b>Як це працює?\n\n\
• Рекомендуємо вивчити курси перед інвестиціями, або мати досвідченого наставника.\n\
• Інвестиції відбуваються у короткостроковому режимі.\n\
• Виберіть область для інвестування, потім суму та час позиції, дочекайтеся результатів інвестування.\n\
• Позиції відкриваються із 100Х кредитним плечем.\n\
• Наша компанія не несе відповідальності за ризики, пов'язані зі зростанням/падінням котирувань.\n</b>"

	trademsg = "<b>💠 Виберіть область для інвестування капіталу</b>"
	cryptomsg = "<b>💠 Виберіть токен для інвестування капіталу</b>"
	companiesmsg = "<b>💠 Виберіть акції для інвестування капіталу</b>"
	rk = "<b>💠 Ринкова капіталізація:</b>"
	kursl = "<b>💲 Курс:</b>"
	dvl = "<b>↕️ Рух ринку:</b>"
	pil = "<b>📊 Остання зміна:</b>"
	futures1 = "<b>💠 Введіть суму позиції</b>"
	futures2 = "<b>🏦 Ваш баланс:</b>"
	futures3 = "<b>Мінімальна позиція:</b>"
	position1 = "<b>📊 Позиція відкрита:</b>"
	position2 = "<b>📊 Позиція закрита:</b>"
	ubl = "<b>📉 Збиток:</b>"
	prl = "<b>📈 Прибуток:</b>"
	pat = "<b>➖ Пат:</b>"
	kbtrade1 = "🪙 Криптовалюти"
	kbtrade2 = "🛡 Акції компаній"
	kbfut1 = "📀 Обновити 📀"
	kbfut2 = "📈 Long, покупка, 100X"
	kbfut3 = "📉 Short, продаж, 100X"
	kbpos1 = "10сек"
	kbpos2 = "30сек"
	kbpos3 = "60сек"
	positionl1 = "<b>💠 Виберіть тривалість утримування позиції</b>"
	positionl2 = "<b>⚠️ Мінімальний розмір позиції</b>"
	positionl3 = "<b>⚠️ Недостатньо грошей на балансі!\nВаш баланс:</b>"
	#
class Eng():

#otherkeys
	kbclose = "❌ Close"
	kbhelp1 = "👨‍💻 Support"
	kbback = "🔙Back🔙"
	kbotmena = "🔙Cancel🔙"
	#
	block = "⚠️ This action is blocked, contact technical support. support"
	error = "⚠️ Сommand not found!"
	#sogl
	newref = "🧑‍💻 You have a new referral"
	newref2 = "🌟 Total referrals"
	soglashenie = "⚠️ Before starting work, familiarize yourself with"
	soglashenielink = f"<a href='{rusogl}'>user agreement</a>"

	kbsogl = "✅ I accept"
	#

	#start
	start = "👋 Welcome to BitMart multi-currency crypto exchange"
	kbstart = "📁 Personal office"
	#

	#menu
	menu1 = "🤴 Personal office"
	menu2 = "💰 Your balance:"
	menu3 = "📤 To withdrawal:"
	menu4 = "🪪 Verification status:"
	menu5 = "🤝 Done deals:"
	menu6 = "📊 Trade rating:"
	menu7 = "⚡️ Number of referrals:"
	menu8 = "📅 Registration Date:"
	menu9 = "🟢 Users online:"
	
	#
	kbmenu1 = "📥 To replenish"
	kbmenu2 = "📤 Withdraw"
	kbmenusite = "📰 Official site"
	kbmenu3 = "⚙️ Settings"

	kbmenu4 = "💱 Trading platform"
	kbmenu5 = "ℹ️ Information"
	kbmenu6 = "🛠 Support"
	#

	#help
	helptext = "<b>Rules for contacting Technical Support:\n\n\
🔹1. Introduce yourself, tell about the problem in your own words - we will try to help you.\n\n\
🔹2. Write your ID - we need it to see your profile and find out about the relevance of your problem.\n\n\
🔹3. Be polite, our consultants are not robots, we will try to help you, and do everything possible to save your time and ensure maximum efficiency in work.\n\n\
Write to us, the answer of Support will not make you wait long!</b>"

	#settigs
	settings = "<b>👨‍💻 Select an action</b>"
	#
	kbsettings1 = "💱 Change currency"
	kbsettings2 = "💬 Change the language"
	kbsettings3 = "📑 Verification"
	#

	#setvalut
	setvalut = "<b>💱 Виберіть свою валюту</b>"
	setvalut2 = "<b>💱 Ваша нова валюта"
	#

	#info
	infotext = "<b>🔹 About the Service\n\n\
BitMart is a safe and secure cryptocurrency exchange platform founded in the UK in 2014. We support more than 190 pairs and 50 cryptocurrencies.\n\n\
❓Frequently asked questions and their answers\n\n\
1. How does investing work?\n\
• Investing takes place in a short period of time during the fall or rise of assets.\n\
2. How does the referral system work?\n\
• After a friend follows your referral link, you are credited with bonuses for his activity.\n\
It also affects your rating.\n\
3. What is a rating?\n\
• The rating is an indicator of your activity.\n\
4. Why is verification needed?\n\
• Account verification is required for large financial transactions.\n\
As well as withdrawal of funds in priority for verified accounts.\n\n\
• If you have any questions, contact Tech. Support</b>"

	#
	kbinfo2 = "📣 Report an error"
	#

	#setlang
	setlang1 = "<b>💬 Choose your language</b>"
	setlang2 = "💬 Your language is now English"
	#

	#verif
	veriftext = "<b>❓Account verification is required for large financial transactions.\n\
❗️Verification can only be done with the help of technical support.\n\
❗️For verification, Technical Support may request your passport data for identification and to confirm your legal age.</b>"

	kbverif = "✔️ Get verified"
	#

	#popoln
	popoln = "<b>📥 Select a method of replenishment of the account:</b>"
	popoln2 = "<b>Replenishment in</b>"
	popoln3 = "<b>To fund your account from an external crypto wallet, use the reusable address below.</b>"
	popoln4 = "<b>💱 Address</b>"
	popoln5 = "<b>Funds will be automatically credited to your account within a certain time. If you have any questions, contact the support service.</b>"
	popoln6 = "<b>⚠️ Dear user, please note that all payments are smaller</b>"
	popoln7 = "<b>will not be included in the service, compensation for these operations is also not provided.</b>"

	popolncard1 = "Minimum account top-up amount:"
	popolncard2 = "Enter the amount:"

	popolncard3 = "<b>📥 Replenishment of the account</b>"
	popolncard4 = "<b>💳 Requisites:</b>"
	popolncard5 = "<b>💬 Comment</b>"
	popolncard6 = "<b>⚠️ To top up the balance, transfer the specified amount:</b>"
	popolncard7 = "<b>, to the requisites specified above!\n\n\
⚠️ Funds will be automatically deposited into your account within 10 minutes.\n\n\
💬 Click on the requisites or comment to copy!\n\n\
🔰 If you cannot provide a comment, please send a receipt/screenshot or receipt to technical support after payment.\n\n\
🛠 Technical support</b>"

	popolncard8 = "<b>⚠️ The minimum amount of replenishment:</b>"
	popolncard9 = "<b>⚠️ Incorrect input</b>"
	sucpopoln = "<b>✅ Your account has been topped up for</b>"
	popolnpaysend1 = "<b>Payment through Paysend Global Transfers</b>\n\nTo top up your account via Paysend, go to https://paysend.com/ and fill out the form.\n\n\
Sender country: Your country\n\
Recipient country: Ukraine\n\
Recipient's card:"
	popolnpaysend2 = "Recipient's name: <code>BitMart</code>\n\n<i>After depositing funds, send a screenshot of the transfer to technical support and the funds will be credited to your account.</i>"

	kbpopoln1 = "💳 Bank card"
	kbpopoln2 = "🔶 Bitcoin"
	kbpopoln3 = "🔷 Ethereum"
	kbpopoln4 = "💲 USDT"
	#

	#vivod
	kbotmenavivod = "❌ Cancel withdrawal"
	alertvivod = "⚠️ Withdrawal request canceled"
	vivod1 = "<b>⚠️ Please note that for security purposes, withdrawals are made to the details from which the last top-up was made.\n\nChoose a withdrawal method:</b>"
	vivodcrypto = "<b>Withdrawal of funds in cryptocurrency\n\n⚠️ Dear user, for technical reasons, withdrawal of funds in cryptocurrency is possible only through the technical support service.</b>"
	vivodcard1 = "Minimum withdrawal amount:"
	vivodcard2 = "Available balance:"
	vivodcard31 = "Enter the amount:"

	vivodcard3 = "<b>✅ The withdrawal request was successfully completed!\n\nWait for it to be processed.</b>"
	vivodcard4 = "<b>⚠️ There are not enough funds on the balance!</b>"
	vivodcard5 = "<b>⚠️ Minimum withdrawal amount!</b>"
	sucvivod = "<b>✅ Withdrawal has been approved!</b>"
	#

	#trade
	faq = "<b>How it works?\n\n\
• We recommend studying courses before investing, or having an experienced mentor.\n\
• Investments take place in the short term.\n\
• Select the area for investment, then the amount and time of the position, wait for the investment results.\n\
• Positions are opened with 100X leverage.\n\
• Our company is not responsible for the risks associated with the growth / fall of quotations.\n</b>"

	trademsg = "<b>💠Choose an area for capital investment</b>"
	cryptomsg = "<b>💠Choose a token for capital investment</b>"
	companiesmsg = "<b>💠Choose stocks to invest in</b>"
	rk = "<b>💠 Market capitalization:</b>"
	kursl = "<b>💲 Exchange rate:</b>"
	dvl = "<b>↕️ Market movement:</b>"
	pil = "<b>📊 Last change:</b>"
	futures1 = "<b>💠 Enter the amount of the position</b>"
	futures2 = "<b>🏦 Your balance:</b>"
	futures3 = "<b>Minimum position:</b>"
	position1 = "<b>📊 The position is open:</b>"
	position2 = "<b>📊 The position is closed:</b>"
	ubl = "<b>📉 Loss:</b>"
	prl = "<b>📈 Profit:</b>"
	pat = "<b>➖ Stalemate:</b>"
	kbtrade1 = "🪙 Cryptocurrencies"
	kbtrade2 = "🛡 Shares of companies"
	kbfut1 = "📀 Update 📀"
	kbfut2 = "📈 Long, purchase, 100X"
	kbfut3 = "📉 Short, selling, 100X"
	kbpos1 = "10сек"
	kbpos2 = "30сек"
	kbpos3 = "60сек"
	positionl1 = "<b>💠 Choose the duration of holding the position</b>"
	positionl2 = "<b>⚠️ Minimum position size</b>"
	positionl3 = "<b>⚠️ Not enough money on the balance!\nYour balance:</b>"
	#

class Language():

	def langf(info):
		if info == "eg":
			return Eng

		if info == "ru":
			return Ru

		if info == "ua":
			return Ua